---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarHandlesData
source: html/7ce5c75a-c1e9-016b-02cf-1118b6fbefad.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData

This class is used to contain the information about the rebar handles defined by an external application.

## Syntax (C#)
```csharp
public class RebarHandlesData : IDisposable
```

## Remarks
All handle tags (custom, start, end) should have different values.